{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "composite_model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 264], "dtype": "float32", "sparse": false, "ragged": false, "name": "model_input"}, "name": "model_input", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 264], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}}, {"class_name": "Dense", "config": {"name": "model_1_dense", "trainable": true, "dtype": "float32", "units": 207, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_1_batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_1_dense_1", "trainable": true, "dtype": "float32", "units": 309, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_1_batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_1_dense_2", "trainable": true, "dtype": "float32", "units": 224, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_1_batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_1_dense_3", "trainable": true, "dtype": "float32", "units": 316, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_1_batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_1_dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "model_1", "inbound_nodes": [[["model_input", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 264], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}}, {"class_name": "Dense", "config": {"name": "model_2_dense", "trainable": true, "dtype": "float32", "units": 164, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_2_batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_2_dense_1", "trainable": true, "dtype": "float32", "units": 263, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_2_batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_2_dense_2", "trainable": true, "dtype": "float32", "units": 209, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_2_batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_2_dense_3", "trainable": true, "dtype": "float32", "units": 195, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_2_batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_2_dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "model_2", "inbound_nodes": [[["model_input", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 264], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}}, {"class_name": "Dense", "config": {"name": "model_3_dense", "trainable": true, "dtype": "float32", "units": 234, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_3_batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_3_dense_1", "trainable": true, "dtype": "float32", "units": 299, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_3_batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_3_dense_2", "trainable": true, "dtype": "float32", "units": 255, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_3_batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_3_dense_3", "trainable": true, "dtype": "float32", "units": 193, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_3_batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_3_dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "model_3", "inbound_nodes": [[["model_input", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 264], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}}, {"class_name": "Dense", "config": {"name": "model_4_dense", "trainable": true, "dtype": "float32", "units": 213, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_4_batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_4_dense_1", "trainable": true, "dtype": "float32", "units": 291, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_4_batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_4_dense_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_4_batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_4_dense_3", "trainable": true, "dtype": "float32", "units": 200, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_4_batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_4_dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "model_4", "inbound_nodes": [[["model_input", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 264], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}}, {"class_name": "Dense", "config": {"name": "model_5_dense", "trainable": true, "dtype": "float32", "units": 213, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_5_batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_5_dense_1", "trainable": true, "dtype": "float32", "units": 245, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_5_batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_5_dense_2", "trainable": true, "dtype": "float32", "units": 249, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_5_batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_5_dense_3", "trainable": true, "dtype": "float32", "units": 185, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "model_5_batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "model_5_dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "model_5", "inbound_nodes": [[["model_input", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_6", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_6", "inbound_nodes": [[["model_1", 1, 0, {"axis": 0}], ["model_2", 1, 0, {"axis": 0}], ["model_3", 1, 0, {"axis": 0}], ["model_4", 1, 0, {"axis": 0}], ["model_5", 1, 0, {"axis": 0}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_6", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_6", "inbound_nodes": [["tf.stack_6", 0, 0, {"axis": 0, "name": "median_output"}]]}], "input_layers": [["model_input", 0, 0]], "output_layers": [["tf.math.reduce_mean_6", 0, 0]]}}, "training_config": {"loss": "mean_squared_error", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "model_1_dense/kernel", "shape": [264, 207], "dtype": "float32"}, {"name": "model_1_dense/bias", "shape": [207], "dtype": "float32"}, {"name": "model_1_batch_normalization/gamma", "shape": [207], "dtype": "float32"}, {"name": "model_1_batch_normalization/beta", "shape": [207], "dtype": "float32"}, {"name": "model_1_dense_1/kernel", "shape": [207, 309], "dtype": "float32"}, {"name": "model_1_dense_1/bias", "shape": [309], "dtype": "float32"}, {"name": "model_1_batch_normalization_1/gamma", "shape": [309], "dtype": "float32"}, {"name": "model_1_batch_normalization_1/beta", "shape": [309], "dtype": "float32"}, {"name": "model_1_dense_2/kernel", "shape": [309, 224], "dtype": "float32"}, {"name": "model_1_dense_2/bias", "shape": [224], "dtype": "float32"}, {"name": "model_1_batch_normalization_2/gamma", "shape": [224], "dtype": "float32"}, {"name": "model_1_batch_normalization_2/beta", "shape": [224], "dtype": "float32"}, {"name": "model_1_dense_3/kernel", "shape": [224, 316], "dtype": "float32"}, {"name": "model_1_dense_3/bias", "shape": [316], "dtype": "float32"}, {"name": "model_1_batch_normalization_3/gamma", "shape": [316], "dtype": "float32"}, {"name": "model_1_batch_normalization_3/beta", "shape": [316], "dtype": "float32"}, {"name": "model_1_dense_4/kernel", "shape": [316, 1], "dtype": "float32"}, {"name": "model_1_dense_4/bias", "shape": [1], "dtype": "float32"}, {"name": "model_1_batch_normalization/moving_mean", "shape": [207], "dtype": "float32"}, {"name": "model_1_batch_normalization/moving_variance", "shape": [207], "dtype": "float32"}, {"name": "model_1_batch_normalization_1/moving_mean", "shape": [309], "dtype": "float32"}, {"name": "model_1_batch_normalization_1/moving_variance", "shape": [309], "dtype": "float32"}, {"name": "model_1_batch_normalization_2/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "model_1_batch_normalization_2/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "model_1_batch_normalization_3/moving_mean", "shape": [316], "dtype": "float32"}, {"name": "model_1_batch_normalization_3/moving_variance", "shape": [316], "dtype": "float32"}, {"name": "model_2_dense/kernel", "shape": [264, 164], "dtype": "float32"}, {"name": "model_2_dense/bias", "shape": [164], "dtype": "float32"}, {"name": "model_2_batch_normalization/gamma", "shape": [164], "dtype": "float32"}, {"name": "model_2_batch_normalization/beta", "shape": [164], "dtype": "float32"}, {"name": "model_2_dense_1/kernel", "shape": [164, 263], "dtype": "float32"}, {"name": "model_2_dense_1/bias", "shape": [263], "dtype": "float32"}, {"name": "model_2_batch_normalization_1/gamma", "shape": [263], "dtype": "float32"}, {"name": "model_2_batch_normalization_1/beta", "shape": [263], "dtype": "float32"}, {"name": "model_2_dense_2/kernel", "shape": [263, 209], "dtype": "float32"}, {"name": "model_2_dense_2/bias", "shape": [209], "dtype": "float32"}, {"name": "model_2_batch_normalization_2/gamma", "shape": [209], "dtype": "float32"}, {"name": "model_2_batch_normalization_2/beta", "shape": [209], "dtype": "float32"}, {"name": "model_2_dense_3/kernel", "shape": [209, 195], "dtype": "float32"}, {"name": "model_2_dense_3/bias", "shape": [195], "dtype": "float32"}, {"name": "model_2_batch_normalization_3/gamma", "shape": [195], "dtype": "float32"}, {"name": "model_2_batch_normalization_3/beta", "shape": [195], "dtype": "float32"}, {"name": "model_2_dense_4/kernel", "shape": [195, 1], "dtype": "float32"}, {"name": "model_2_dense_4/bias", "shape": [1], "dtype": "float32"}, {"name": "model_2_batch_normalization/moving_mean", "shape": [164], "dtype": "float32"}, {"name": "model_2_batch_normalization/moving_variance", "shape": [164], "dtype": "float32"}, {"name": "model_2_batch_normalization_1/moving_mean", "shape": [263], "dtype": "float32"}, {"name": "model_2_batch_normalization_1/moving_variance", "shape": [263], "dtype": "float32"}, {"name": "model_2_batch_normalization_2/moving_mean", "shape": [209], "dtype": "float32"}, {"name": "model_2_batch_normalization_2/moving_variance", "shape": [209], "dtype": "float32"}, {"name": "model_2_batch_normalization_3/moving_mean", "shape": [195], "dtype": "float32"}, {"name": "model_2_batch_normalization_3/moving_variance", "shape": [195], "dtype": "float32"}, {"name": "model_3_dense/kernel", "shape": [264, 234], "dtype": "float32"}, {"name": "model_3_dense/bias", "shape": [234], "dtype": "float32"}, {"name": "model_3_batch_normalization/gamma", "shape": [234], "dtype": "float32"}, {"name": "model_3_batch_normalization/beta", "shape": [234], "dtype": "float32"}, {"name": "model_3_dense_1/kernel", "shape": [234, 299], "dtype": "float32"}, {"name": "model_3_dense_1/bias", "shape": [299], "dtype": "float32"}, {"name": "model_3_batch_normalization_1/gamma", "shape": [299], "dtype": "float32"}, {"name": "model_3_batch_normalization_1/beta", "shape": [299], "dtype": "float32"}, {"name": "model_3_dense_2/kernel", "shape": [299, 255], "dtype": "float32"}, {"name": "model_3_dense_2/bias", "shape": [255], "dtype": "float32"}, {"name": "model_3_batch_normalization_2/gamma", "shape": [255], "dtype": "float32"}, {"name": "model_3_batch_normalization_2/beta", "shape": [255], "dtype": "float32"}, {"name": "model_3_dense_3/kernel", "shape": [255, 193], "dtype": "float32"}, {"name": "model_3_dense_3/bias", "shape": [193], "dtype": "float32"}, {"name": "model_3_batch_normalization_3/gamma", "shape": [193], "dtype": "float32"}, {"name": "model_3_batch_normalization_3/beta", "shape": [193], "dtype": "float32"}, {"name": "model_3_dense_4/kernel", "shape": [193, 1], "dtype": "float32"}, {"name": "model_3_dense_4/bias", "shape": [1], "dtype": "float32"}, {"name": "model_3_batch_normalization/moving_mean", "shape": [234], "dtype": "float32"}, {"name": "model_3_batch_normalization/moving_variance", "shape": [234], "dtype": "float32"}, {"name": "model_3_batch_normalization_1/moving_mean", "shape": [299], "dtype": "float32"}, {"name": "model_3_batch_normalization_1/moving_variance", "shape": [299], "dtype": "float32"}, {"name": "model_3_batch_normalization_2/moving_mean", "shape": [255], "dtype": "float32"}, {"name": "model_3_batch_normalization_2/moving_variance", "shape": [255], "dtype": "float32"}, {"name": "model_3_batch_normalization_3/moving_mean", "shape": [193], "dtype": "float32"}, {"name": "model_3_batch_normalization_3/moving_variance", "shape": [193], "dtype": "float32"}, {"name": "model_4_dense/kernel", "shape": [264, 213], "dtype": "float32"}, {"name": "model_4_dense/bias", "shape": [213], "dtype": "float32"}, {"name": "model_4_batch_normalization/gamma", "shape": [213], "dtype": "float32"}, {"name": "model_4_batch_normalization/beta", "shape": [213], "dtype": "float32"}, {"name": "model_4_dense_1/kernel", "shape": [213, 291], "dtype": "float32"}, {"name": "model_4_dense_1/bias", "shape": [291], "dtype": "float32"}, {"name": "model_4_batch_normalization_1/gamma", "shape": [291], "dtype": "float32"}, {"name": "model_4_batch_normalization_1/beta", "shape": [291], "dtype": "float32"}, {"name": "model_4_dense_2/kernel", "shape": [291, 128], "dtype": "float32"}, {"name": "model_4_dense_2/bias", "shape": [128], "dtype": "float32"}, {"name": "model_4_batch_normalization_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "model_4_batch_normalization_2/beta", "shape": [128], "dtype": "float32"}, {"name": "model_4_dense_3/kernel", "shape": [128, 200], "dtype": "float32"}, {"name": "model_4_dense_3/bias", "shape": [200], "dtype": "float32"}, {"name": "model_4_batch_normalization_3/gamma", "shape": [200], "dtype": "float32"}, {"name": "model_4_batch_normalization_3/beta", "shape": [200], "dtype": "float32"}, {"name": "model_4_dense_4/kernel", "shape": [200, 1], "dtype": "float32"}, {"name": "model_4_dense_4/bias", "shape": [1], "dtype": "float32"}, {"name": "model_4_batch_normalization/moving_mean", "shape": [213], "dtype": "float32"}, {"name": "model_4_batch_normalization/moving_variance", "shape": [213], "dtype": "float32"}, {"name": "model_4_batch_normalization_1/moving_mean", "shape": [291], "dtype": "float32"}, {"name": "model_4_batch_normalization_1/moving_variance", "shape": [291], "dtype": "float32"}, {"name": "model_4_batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "model_4_batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "model_4_batch_normalization_3/moving_mean", "shape": [200], "dtype": "float32"}, {"name": "model_4_batch_normalization_3/moving_variance", "shape": [200], "dtype": "float32"}, {"name": "model_5_dense/kernel", "shape": [264, 213], "dtype": "float32"}, {"name": "model_5_dense/bias", "shape": [213], "dtype": "float32"}, {"name": "model_5_batch_normalization/gamma", "shape": [213], "dtype": "float32"}, {"name": "model_5_batch_normalization/beta", "shape": [213], "dtype": "float32"}, {"name": "model_5_dense_1/kernel", "shape": [213, 245], "dtype": "float32"}, {"name": "model_5_dense_1/bias", "shape": [245], "dtype": "float32"}, {"name": "model_5_batch_normalization_1/gamma", "shape": [245], "dtype": "float32"}, {"name": "model_5_batch_normalization_1/beta", "shape": [245], "dtype": "float32"}, {"name": "model_5_dense_2/kernel", "shape": [245, 249], "dtype": "float32"}, {"name": "model_5_dense_2/bias", "shape": [249], "dtype": "float32"}, {"name": "model_5_batch_normalization_2/gamma", "shape": [249], "dtype": "float32"}, {"name": "model_5_batch_normalization_2/beta", "shape": [249], "dtype": "float32"}, {"name": "model_5_dense_3/kernel", "shape": [249, 185], "dtype": "float32"}, {"name": "model_5_dense_3/bias", "shape": [185], "dtype": "float32"}, {"name": "model_5_batch_normalization_3/gamma", "shape": [185], "dtype": "float32"}, {"name": "model_5_batch_normalization_3/beta", "shape": [185], "dtype": "float32"}, {"name": "model_5_dense_4/kernel", "shape": [185, 1], "dtype": "float32"}, {"name": "model_5_dense_4/bias", "shape": [1], "dtype": "float32"}, {"name": "model_5_batch_normalization/moving_mean", "shape": [213], "dtype": "float32"}, {"name": "model_5_batch_normalization/moving_variance", "shape": [213], "dtype": "float32"}, {"name": "model_5_batch_normalization_1/moving_mean", "shape": [245], "dtype": "float32"}, {"name": "model_5_batch_normalization_1/moving_variance", "shape": [245], "dtype": "float32"}, {"name": "model_5_batch_normalization_2/moving_mean", "shape": [249], "dtype": "float32"}, {"name": "model_5_batch_normalization_2/moving_variance", "shape": [249], "dtype": "float32"}, {"name": "model_5_batch_normalization_3/moving_mean", "shape": [185], "dtype": "float32"}, {"name": "model_5_batch_normalization_3/moving_variance", "shape": [185], "dtype": "float32"}]}]}